use colored::Colorize;
use rand;

pub fn print_msg() {
    let a = rand::random::<u8>();
    if a % 2 == 0 {
        let i = rand::random::<u8>();
        if i % 2 == 0 && i % 4 == 0 {
            eprintln!(
                "{}",
                "СООБЩЕНИЕ ОТ БИБЛИОТЕКИ lfa-rs".bold().red().on_white()
            );
            eprintln!("***************************************************************");
            eprintln!("* Для продолжения работы над LFA мне требуется новый ноутбук. *");
            eprintln!("* Для того, чтобы я мог его купить, вы можете отправить мне   *");
            eprintln!("* донат на карту (сбербанк):                                  *");
            eprintln!("*           2202 2062 5233 5406 (Михаил Сергеевич)            *");
            eprintln!("***************************************************************")
        }
    }
}
